In [1]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\ramyalakshmanan\anaconda3\lib\site-packages (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np
import pymysql

In [15]:
df_busno_1=pd.read_csv("df_busno_1.csv")
df_busno_2=pd.read_csv("df_busno_2.csv")
df_busno_3=pd.read_csv("df_busno_3.csv")
df_busno_4=pd.read_csv("df_busno_4.csv")
df_busno_5=pd.read_csv("df_busno_5.csv")
df_busno_6=pd.read_csv("df_busno_6.csv")
df_busno_7=pd.read_csv("df_busno_7.csv")
df_busno_8=pd.read_csv("df_busno_8.csv")
df_busno_9=pd.read_csv("df_busno_9.csv")
df_busno_10=pd.read_csv("df_busno_10.csv")

Final_df=pd.concat([df_busno_1,df_busno_2,df_busno_3,df_busno_4,df_busno_5,df_busno_6,
                    df_busno_7,df_busno_8,df_busno_9,df_busno_10],ignore_index=True)
Final_df

,Bus_name,Bus_type,Start_time,End_time,Total_duration,Price,Seats_Available,Ratings,Route_link,Route_name
0,KSRTC (Kerala) - 52,SWIFT-GARUDA A/C SEATER BUS,12:00,20:20,08h 20m,INR 945,18 Seats available,4.0\n133,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
1,KSRTC (Kerala) - 1378,AC MULTI AXLE,13:46,21:25,07h 39m,INR 1099,10 Seats available,2.8\n34,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
2,KSRTC (Kerala) - 129,SWIFT-GARUDA A/C SEATER BUS,14:15,23:05,08h 50m,INR 945,23 Seats available,4.3\n93,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
3,KSRTC (Kerala) - 235,Swift Deluxe Non AC Air Bus (2+2),15:00,01:00,10h 00m,INR 801,9 Seats available,4.0\n16,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
4,KSRTC (Kerala) - 370,AC MULTI AXLE,15:25,23:45,08h 20m,INR 1099,18 Seats available,2.9\n43,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
...,...,...,...,...,...,...,...,...,...,...
9079,Droupadi City Service,A/C Seater (2+3),15:20,18:10,02h 50m,180,60 Seats available,3.0\n66,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
9080,Swapna Paribahan,Non AC Seater (2+3),16:55,21:25,04h 30m,INR 150,25 Seats available,3.0\n9,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
9081,Droupadi Paribahan,A/C Seater (2+3),14:10,16:58,02h 48m,INR 160,59 Seats available,2.7\n31,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
9082,KRISHNAKALI,A/C Seater (2+3),14:45,17:30,02h 45m,INR 165,61 Seats available,2.2\n50,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
9083,Droupadi Bus Service,Non AC Seater (2+3),16:20,19:10,02h 50m,INR 121,54 Seats available,2.2\n20,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia

In [19]:
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9084 entries, 0 to 9083
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         9077 non-null   object
 1   Bus_type         9068 non-null   object
 2   Start_time       9077 non-null   object
 3   End_time         9077 non-null   object
 4   Total_duration   9077 non-null   object
 5   Price            9073 non-null   object
 6   Seats_Available  9068 non-null   object
 7   Ratings          9073 non-null   object
 8   Route_link       9084 non-null   object
 9   Route_name       9084 non-null   object
dtypes: object(10)
memory usage: 709.8+ KB

In [21]:
Final_df["Price"]=Final_df["Price"].str.replace("INR","")
Final_df["Price"]=Final_df["Price"].astype(float)
Final_df["Price"].fillna(0)

0        945.0
1       1099.0
2        945.0
3        801.0
4       1099.0
         ...
9079     180.0
9080     150.0
9081     160.0
9082     165.0
9083     121.0
Name: Price, Length: 9084, dtype: float64

In [23]:
Final_df["Ratings"]=Final_df["Ratings"].str.replace("New","")
Final_df["Ratings"]=Final_df["Ratings"].str.strip()
Final_df["Ratings"]=Final_df["Ratings"].str.split().str[0]
Final_df["Ratings"] = pd.to_numeric(Final_df["Ratings"], errors='coerce')
Final_df["Ratings"].fillna(0,inplace=True)

C:\Users\Ramyalakshmanan\AppData\Local\Temp\ipykernel_20692\2582007703.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Final_df["Ratings"].fillna(0,inplace=True)

In [25]:
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9084 entries, 0 to 9083
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         9077 non-null   object
 1   Bus_type         9068 non-null   object
 2   Start_time       9077 non-null   object
 3   End_time         9077 non-null   object
 4   Total_duration   9077 non-null   object
 5   Price            9073 non-null   float64
 6   Seats_Available  9068 non-null   object
 7   Ratings          9084 non-null   float64
 8   Route_link       9084 non-null   object
 9   Route_name       9084 non-null   object
dtypes: float64(2), object(8)
memory usage: 709.8+ KB

In [27]:
Final_df = Final_df[Final_df["Price"] <= 7000]

In [31]:
Final_df = Final_df.replace({np.nan: None})

In [33]:
path=r"C:/Users/Ramyalakshmanan/Desktop/RedBus/Full_busdetails_df.csv"
Final_df.to_csv(path,index=False)

In [41]:
print(Final_df['Bus_type'].isnull().sum()) 
Final_df['Bus_type'] = Final_df['Bus_type'].fillna('Unknown')
print(Final_df['Bus_type'].isnull().sum())  # Should show 0 if all missing values are filled

5
0

In [50]:
# Replace all None/NaN values with default values, for example, 0 or 'Unknown' for string columns
Final_df = Final_df.fillna({'Seats_Available': 0, 'Bus_type': 'Unknown'})

In [35]:
con = pymysql.connect(
    host="localhost",
    user="root",
    password="Ramya",
    database="REDBUS_DATABASE"
)
my_cursor = con.cursor()
my_cursor.execute("CREATE DATABASE IF NOT EXISTS REDBUS_DATABASE")
print("Database Connected successfully")

Database Connected successfully

In [37]:
my_cursor.execute('''CREATE TABLE IF NOT EXISTS bus_details(
                  ID INT AUTO_INCREMENT PRIMARY KEY,
                  Bus_name VARCHAR(255) NOT NULL,
                  Bus_type VARCHAR(255) NOT NULL,
                  Start_time VARCHAR(255) NOT NULL,
                  End_time VARCHAR(255) NOT NULL,
                  Total_duration VARCHAR(255) NOT NULL,
                  Price FLOAT NULL,
                  Seats_Available VARCHAR(255) NOT NULL,
                  Ratings Float NULL,
                  Route_link VARCHAR(255) NULL,
                  Route_name VARCHAR(255) NULL
                  )''')
print("Table Created successfully")

Table Created successfully

In [52]:
insert_query = ('''INSERT INTO bus_details(
                    Bus_name,
                    Bus_type,
                    Start_time,
                    End_time,
                    Total_duration,
                    Price,
                    Seats_Available,
                    Ratings,
                    Route_link,
                    Route_name)
                  VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)''')

data = Final_df.values.tolist()

try:
    my_cursor.executemany(insert_query, data)
    con.commit()
    print("Values inserted successfully")
except Exception as e:
    print(f"Error: {e}")

Values inserted successfully